fulminati/esp8266-web-socket/src/main.cpp
#include <Arduino.h>

/*********
  Rui Santos
  Complete project details at https://RandomNerdTutorials.com/esp32-websocket-server-arduino/
  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.
*********/

// Import required libraries
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>

// Copy the file 'src/secrets.txt' to 'src/secrets.h' and change your secrets inside.
#include "secrets.h"

bool ledState = 0;
const int ledPin = 2;

// Create AsyncWebServer object on port 80
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

// @inject "../web/index.html"
const char index_html[] PROGMEM = "<!DOCTYPE HTML><html><head><title>ESP8266 WebSocket</title><meta name=viewport content=\"width=device-width, initial-scale=1\"><link rel=icon href=data:,><link rel=stylesheet href=/style.css></head><body><div class=topnav><h1>ESP8266 WebSocket</h1></div><div class=content><div class=card><h2>Output - GPIO 2</h2><p class=state>state: <span id=state>%STATE%</span></p><p><button id=button class=button>Toggle</button></p></div></div><script>var gateway=`ws://${window.location.hostname}/ws`;var websocket;window.addEventListener('load',onLoad);function initWebSocket(){console.log('Trying to open a WebSocket connection...');websocket=new WebSocket(gateway);websocket.onopen=onOpen;websocket.onclose=onClose;websocket.onmessage=onMessage;}\nfunction onOpen(event){console.log('Connection opened');}\nfunction onClose(event){console.log('Connection closed');setTimeout(initWebSocket,2000);}\nfunction onMessage(event){var state;if(event.data==\"1\"){state=\"ON\";}\nelse{state=\"OFF\";}\ndocument.getElementById('state').innerHTML=state;}\nfunction onLoad(event){initWebSocket();initButton();}\nfunction initButton(){document.getElementById('button').addEventListener('click',toggle);}\nfunction toggle(){websocket.send('toggle');}</script></body></html>";

// @inject "../web/style.css"
const char style_css[] PROGMEM = "html{font-family:Arial,Helvetica,sans-serif;text-align:center}h1{font-size:1.8rem;color:white}h2{font-size:1.5rem;font-weight:bold;color:#143642}.topnav{overflow:hidden;background-color:#143642}body{margin:0}.content{padding:30px;max-width:600px;margin:0 auto}.card{background-color:#f8f7f9;box-shadow:2px 2px 12px 1px rgba(140,140,140,.5);padding-top:10px;padding-bottom:20px}.button{padding:15px 50px;font-size:24px;text-align:center;outline:0;color:#fff;background-color:#0f8b8d;border:0;border-radius:5px;-webkit-touch-callout:none;-webkit-user-select:none;-khtml-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none;-webkit-tap-highlight-color:rgba(0,0,0,0)}.button:active{background-color:#0f8b8d;box-shadow:2 2px #cdcdcd;transform:translateY(2px)}.state{font-size:1.5rem;color:#8c8c8c;font-weight:bold}";

// @inject "../web/app.js"
//const String app_js PROGMEM = "var gateway=`ws://${window.location.hostname}/ws`;var websocket;window.addEventListener('load',onLoad);function initWebSocket(){console.log('Trying to open a WebSocket connection...');websocket=new WebSocket(gateway);websocket.onopen=onOpen;websocket.onclose=onClose;websocket.onmessage=onMessage;}\nfunction onOpen(event){console.log('Connection opened');}\nfunction onClose(event){console.log('Connection closed');setTimeout(initWebSocket,2000);}\nfunction onMessage(event){var state;if(event.data==\"1\"){state=\"ON\";}\nelse{state=\"OFF\";}\ndocument.getElementById('state').innerHTML=state;}\nfunction onLoad(event){initWebSocket();initButton();}\nfunction initButton(){document.getElementById('button').addEventListener('click',toggle);}\nfunction toggle(){websocket.send('toggle');}";

void notifyClients() {
  ws.textAll(String(ledState));
}

void handleWebSocketMessage(void *arg, uint8_t *data, size_t len) {
  AwsFrameInfo *info = (AwsFrameInfo*)arg;
  if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT) {
    data[len] = 0;
    if (strcmp((char*)data, "toggle") == 0) {
      ledState = !ledState;
      notifyClients();
    }
  }
}

void onEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type,
             void *arg, uint8_t *data, size_t len) {
  switch (type) {
    case WS_EVT_CONNECT:
      Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
      break;
    case WS_EVT_DISCONNECT:
      Serial.printf("WebSocket client #%u disconnected\n", client->id());
      break;
    case WS_EVT_DATA:
      handleWebSocketMessage(arg, data, len);
      break;
    case WS_EVT_PONG:
    case WS_EVT_ERROR:
      break;
  }
}

void initWebSocket() {
  ws.onEvent(onEvent);
  server.addHandler(&ws);
}

String processor(const String& var){
  Serial.println(var);
  if(var == "STATE"){
    if (ledState){
      return "ON";
    }
    else{
      return "OFF";
    }
  }
  return String();
}

void setup(){
  // Serial port for debugging purposes
  Serial.begin(115200);

  pinMode(ledPin, OUTPUT);
  digitalWrite(ledPin, LOW);
  
  // Connect to Wi-Fi
  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED) {
    delay(1000);
    Serial.println("Connecting to WiFi..");
  }

  // Print ESP Local IP Address
  Serial.println(WiFi.localIP());

  initWebSocket();

  // Route for root / web page
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html, processor);
  });

  // Route for file /style.css
  server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/css", style_css, processor);
  });

  // Start server
  server.begin();
}

void loop() {
  ws.cleanupClients();
  digitalWrite(ledPin, ledState);
}
